app/Models/ExploreModel.php

    public function tampil_post()
    {
        return $this->db->table("postingan")
            ->join('user', 'user.id_user = postingan.id_user', 'left')
            ->orderBy('id_postingan', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `postingan`
LEFT JOIN `user` ON `user`.`id_user` = `postingan`.`id_user`
ORDER BY `id_postingan` DESC