app/Models/LoginModel.php

    public function cek_login($email, $password)
    {
        return $this->db->table('user')->where([
            'email' => $email,
            'password' => $password,
        ])->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `email` = 'budi@gmail.com'
AND `password` = 'MTIz'