app/Models/ProfileModel.php

SELECT *
FROM `user`
WHERE `id_user` = '7'
---
    public function tampil_data()
    {
        $session = session();
        return $this->db->table("user")
            ->where('id_user', $session->get('id_user'))
            ->get()->getRowArray();

SELECT *
FROM `postingan`
WHERE `id_user` = '7'
---
    public function tampil_post()
    {
        $session = session();
        return $this->db->table("postingan")
            ->where('id_user', $session->get('id_user'))