app/Models/TamuModel.php

    public function tampil_tamu()
    {
        return $this->db->table("bukutamu")
            ->orderBy('id_tamu', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `bukutamu`
ORDER BY `id_tamu` ASC